[
{
        "categoryName":"Beans & Legumes",
         "categoryName-href":"https://www.kawalingpinoy.com/category/recipe-index/beans-and-legumes/",
         "link":"Bibingkoy",
         "link-ref":"https://www.kawalingpinoy.com/bibingkoy/",
         "recipeDescription":"Soft, chewy, and delicious Bibingkoy with red mung bean filling and a creamy ginataan sauce with mini sago and langka. Each bite of this delightful kakanin is an explosion of flavors and textures that will surely leave you wanting more.",
         "recipeImage-href":"https://www.kawalingpinoy.com/wp-content/uploads/2023/09/bibingkoy-2-680x680.jpg",
         "recipePrepTime":"Prep Time: 20 minutes mins",
         "recipeCookTime":"Cook Time: 20 minutes mins",
         "recipeTotalTIme":"Total Time: 40 minutes mins",
         "recipeAuthor":"Lalaine Manalo",
         "recipeIngredients":[
            "1 cup red mung beans",
            "water",
            "1 cup sugar",
            "3 tablespoons cornstarch",
            "4 cups glutinous rice flour",
            "2 cups coconut cream",
            "1 cup cooked mini sago",
            "1 cup jackfruit strips"
         ],
         "recipeInstruction":[
            "In a bowl, combine red mung beans and enough water to cover, and soak overnight.",
            "Drain well and place in a pot with water. Bring to a boil, skiming any foam that floats. Lower heat, cover, and cook for about 1 hour or until beans are tender.",
            "Remove from heat. Mash beans until smooth. Transfer into a wide pan.",
            "Add ½ cup of sugar and cook until sugar is dissolved.",
            "In a bowl, combine ¼ cup of water and 2 tablespoons of cornstarch. Stir until smooth and slowly add to the beans. Cook, stirring regularly, until thickened.",
            "Remove from heat and allow to slightly cool. Transfer to a bowl and cover with cling wrap, pressing the plastic film on the surface of the beans. Refrigerate to cool completely.",
            "Scoop into portions and shape into balls. Set aside.",
            "In a bowl, combine glutinous rice flour and 1 ¾ cups of water, slowly adding water until a dough forms. Stir until the dough becomes smooth and pliable.",
            "Scoop dough and flatten into a circle. Place a red bean ball in the center of the dough. Fold the dough around to cover the filling. Roll into a smooth, round ball. Repeat with the remaining mixture.",
            "Arrange the sticky rice dumplings in a single layer on a lightly oiled baking dish. Place in a steamer and cover with a kitchen towel and steamer lid. Steam for about 20 minutes.",
            "Meanwhile, preheat oven to 400 F.",
            "Remove from steamer and place in the oven. Bake for about 8-10 minutes or until tops are golden. Set aside.",
            "In a pot over. medium heat, combine coconut cream, 1 cup of water, and ½ cup of sugar. Stir until sugar is dissolved. Bring to a simmer.",
            "In a small bowl, combine 2 tablespoons of water and 1 tablespoon of cornstarch. Stir until smooth. Gently add to the coconut cream mixture, whisking vigorously to prevent lumps. Continue to cook until the mixture thickens.",
            "Add cooked mini sago and jackfruit strips. Cook for about 2-3 minutes.",
            "To serve, place baked bibingkoy on a plate and spoon ginataan sauce on top."

          
       ],
         "recipeNutrition":[
            "Calories: 514kcal",
            "Carbohydrates: 88g",
            "Protein: 9g",
            "Fat: 15g",
            "Saturated Fat: 13g",
            "Polyunsaturated Fat: 0.4g",
            "Monounsaturated Fat: 1g",
            "Sodium: 23mg",
            "Potassium: 400mg",
            "Fiber: 6g",
            "Sugar: 18g",
            "Vitamin A: 20IU",
            "Vitamin C: 2mg",
            "Calcium: 39mg",
            "Iron: 2mg"

            
         ],
         "recipeVote":"5"
}

]