[
{
    "categoryName":"Rice & Noodles",
     "categoryName-href":"https://www.kawalingpinoy.com/category/recipe-index/rice-potatoes-and-noodles/",
     "link":"Turon Malagkit",
     "link-ref":"https://www.kawalingpinoy.com/turon-malagkit/",
     "recipeDescription":"Turon Malagkit filled with sticky rice and jackfruit, coated with sugar, and fried until golden and caramelized. These Filipino spring rolls are filling, delicious and perfect as snack or dessert.",
     "recipeImage-href":"https://www.kawalingpinoy.com/wp-content/uploads/2019/06/turon-malagkit-15-680x680.jpg",
     "recipePrepTime":"Prep Time: 20 minutes mins",
     "recipeCookTime":"Cook Time: 30 minutes mins",
     "recipeTotalTIme":"",
     "recipeAuthor":"Lalaine Manalo",
     "recipeIngredients":[
         "2 cups glutinous rice",
         "2 ½ cups coconut milk",
         "½ teaspoon salt",
         "1 pandan leaf, knotted (optional)",
         "24 spring roll wrappers",
         "1 cup sweetened jackfruit strips",
         "1 cup sugar",
         "canola oil"
     ],
     "recipeInstruction":[
         "In a bowl, rinse glutinous rice 2 to 3 times or until water runs clear. Drain well using a fine-mesh sieve.",
         "In the rice cooker insert, combine rice, coconut milk, and salt. Stir to distribute. Place pandan leaf in the rice, if using.",
         "Cook in the rice cooker. When the rice cooker beeps, allow to stand, covered, for about 5 minutes.",
         "Remove pandan leaf from the cooked rice and discard.  With a fork, gently fluff rice to separate grains and allow to cool completely.",
         "Separate wrappers into individual sheets. On a flat working surface, lay the wrapper like a diamond.",
         "Spoon about 2 tablespoons of cooked sticky rice in the middle of the wrapper and top with 2 to 3 jackfruit strips.",
         "Fold the bottom pointed end of the wrapper over the filling. Fold the side ends of the sheet inward and roll tightly into a log. Wet the pointed edge of the wrapper with a dab of water to completely seal. Repeat with the remaining rice mixture",
         "In a shallow plate, roll turon in sugar to fully coat.",
         "In a skillet over medium heat, heat about 2 inches deep of oil. Add spring rolls seam side down and fry, turning once or twice, for about 2 to 3 minutes on each side or until golden brown and sugar is caramelized.",
         "Using tongs, remove turon from the pan and drain on a wire rack set over a baking sheet.  Serve immediately."
     ],
     "recipeNutrition":[
         "Calories: 218kcal",
         "Carbohydrates: 34g",
         "Protein: 3g",
         "Fat: 8g",
         "Saturated Fat: 5g",
         "Sodium: 162mg",
         "Potassium: 86mg",
         "Fiber: 1g",
         "Sugar: 8g",
         "Vitamin A: 5IU",
         "Vitamin C: 0.2mg",
         "Calcium: 18mg",
         "Iron: 1.7mg"
     ],
     "recipeVote":"4"
},
{
    "categoryName":"Rice & Noodles",
     "categoryName-href":"https://www.kawalingpinoy.com/category/recipe-index/rice-potatoes-and-noodles/",
     "link":"Bibingkang Malagkit",
     "link-ref":"https://www.kawalingpinoy.com/bibingkang-malagkit/",
     "recipeDescription":"Bibingkang Malagkit is the ultimate sweet treat! Soft, chewy, and topped with sweetened coconut spread, it's sure to be a crowd-pleaser. And it's gluten-free, too!",
     "recipeImage-href":"https://www.kawalingpinoy.com/wp-content/uploads/2018/09/bibingkang-malagkit-11-680x680.jpg",
     "recipePrepTime":"Prep Time: 10 minutes mins",
     "recipeCookTime":"Cook Time: 2 hours hrs",
     "recipeTotalTIme":"Total Time: 2 hours hrs 10 minutes mins",
     "recipeAuthor":"Lalaine Manalo",
     "recipeIngredients":[
         "1 tablespoon coconut oil or melted butter",
         "2 cups glutinous rice, washed and drained well",
         "1 ½ cups water",
         "1 pandan leaf, optional",
         "5 cups coconut milk",
         "¾ cup white sugar",
         "¼ teaspoon salt",
         "1 cup brown sugar"
     ],
     "recipeInstruction":[
         "Brush bottom and sides of a 5 x 8 baking dish with coconut oil or melted butter. Set aside.",
         "Rinse glutinous rice a few times or until water runs almost clear. Drain well.",
         "In a deep, thick-bottomed pot or rice cooker, combine rice and water. Tie a pandan leaf into a knot and add it to the rice.",
         "Over medium heat, bring to a boil. Lower heat, cover, and cook until liquid is absorbed.",
         "Allow to cool to touch and fluff with a fork to separate grains. Discard pandan leaf.",
         "In a wide non-stick skillet over medium heat, combine 3 cups coconut milk, white sugar, and salt. Stir until sugar is dissolved and bring to a simmer.  Lower heat and continue to cook until slightly reduced and thickened.",
         "Add rice, gently stirring to distribute evenly. Cook, stirring occasionally, for about 50 to 60 minutes or until the mixture is very thick and sticky, and pulls away from the sides of the pan.",
         "Meanwhile, In a non-stick pan over medium heat, combine the remaining 2 cups coconut milk and brown sugar. Cook, stirring occasionally, until very thick yet spreadable.",
         "Transfer the sticky rice into the prepared baking dish and pat down with a lightly greased spatula to even out.",
         "Spoon coconut caramel topping over rice and spread across the surface to completely cover.",
         "Bake in a 350 F oven for about 20 to 30 minutes or until topping is caramelized and bubbly.",
         "Remove from oven and allow to cool completely before slicing."
     ],
     "recipeNutrition":[
        "Calories: 645kcal",
        "Carbohydrates: 89g",
        "Protein: 6g",
        "Fat: 32g",
        "Saturated Fat: 28g",
        "Polyunsaturated Fat: 0.5g",
        "Monounsaturated Fat: 2g",
        "Trans Fat: 0.1g",
        "Cholesterol: 4mg",
        "Sodium: 121mg",
        "Potassium: 411mg",
        "Fiber: 1g",
        "Sugar: 47g",
        "Vitamin A: 44IU",
        "Vitamin C: 1mg",
        "Calcium: 72mg",
        "Iron: 6mg"
     ],
     "recipeVote":"3.86"
},
{
    "categoryName":"Rice & Noodles",
     "categoryName-href":"https://www.kawalingpinoy.com/category/recipe-index/rice-potatoes-and-noodles/",
     "link":"Sapin-Sapin",
     "link-ref":"https://www.kawalingpinoy.com/sapin-sapin/",
     "recipeDescription":"Sapin-Sapin is made of glutinous rice flour and coconut milk. Soft, chewy, and with latik topping, it's a colorful dessert that's tasty as it's pretty!",
     "recipeImage-href":"https://www.kawalingpinoy.com/wp-content/uploads/2019/03/sapin-sapin-kalamay-680x680.jpg",
     "recipePrepTime":"Prep Time: 10 minutes mins",
     "recipeCookTime":"Cook Time: 50 minutes mins",
     "recipeTotalTIme":"Total Time: 1 hour hr",
     "recipeAuthor":"Lalaine Manalo",
     "recipeIngredients":[
        "1 cup coconut cream (kakang gata)",
        "3 ½ cups glutinous rice flour",
        "2 cans (13.5 ounces each) coconut milk",
        "1 can (14 ounces) condensed milk",
        "1 cup sugar",
        "3 drops ube flavor extract",
        "3 drops langka flavor extract"
        
     ],
     "recipeInstruction":[
        "In a pan over medium heat, add coconut cream and bring to a boil. Cook, stirring occasionally until liquid starts to thicken.",
        "Lower heat and continue to cook. As oil starts to separate and solids begin to form, regularly stir and scrape sides and bottom of the pan to prevent from burning. Continue to cook and stir until curds turn golden brown.",
        "Drain latik from the oil and store in separate containers until ready to use.",
        "Generously brush inner sides and bottom of an 8-inch round baking pan with the oil.",
        "In a large bowl, combine glutinous rice flour, coconut milk, condensed milk, and sugar. Stir together until sugar is dissolved and mixture is smooth and well blended.",
        "Strain the batter using a fine-mesh sieve and divide evenly into three bowls.",
        "In one bowl, add ube extract and stir until color is well dispersed. In another bowl, add Langka extract and stir until color is well dispersed. The remaining portion will be white and plain.",
        "Pour ube-flavored batter into the prepared baking pan. Steam for about 10 minutes or until set and toothpick inserted comes out clean.",
        "Carefully pour langka-flavored batter over purple layer. Steam for about 10 minutes or until set and toothpick inserted comes out clean.",
        "Gently pour plain batter over yellow layer. Steam for about 10 minutes or until set and toothpick inserted comes out clean.",
        "Remove cake pan from steamer and allow to cool completely.",
        "Run a knife around the sides of the pan to loosen the rice cake. Place a wide, flat serving platter over cake pan and gently invert. Tap the pan a few times to release the sapin-sapin onto the platter (purple layer will now be the top layer).",
        "Liberally brush top and sides of sapin sapin with coconut oil.  Sprinkle latik on top and cut the cake into serving portions."
        
     ],
     "recipeNutrition":[
        "Calories: 557kcal",
        "Carbohydrates: 80g",
        "Protein: 8g",
        "Fat: 24g",
        "Saturated Fat: 20g",
        "Cholesterol: 11mg",
        "Sodium: 51mg",
        "Potassium: 368mg",
        "Fiber: 2g",
        "Sugar: 35g",
        "Vitamin A: 90IU",
        "Vitamin C: 2.1mg",
        "Calcium: 113mg",
        "Iron: 2.8mg"
     ],
     "recipeVote":"3.82"
},
{
    "categoryName":"Rice & Noodles",
     "categoryName-href":"https://www.kawalingpinoy.com/category/recipe-index/rice-potatoes-and-noodles/",
     "link":"Ginataang Manok",
     "link-ref":"https://www.kawalingpinoy.com/ginataang-manok/",
     "recipeDescription":"Spicy Chicken in Coconut Sauce is a Filipino stew that's easy to make and full of flavor. It's creamy, spicy, and delicious with steamed rice!",
     "recipeImage-href":"https://www.kawalingpinoy.com/wp-content/uploads/2016/10/ginataang-manok-8-680x680.jpg",
     "recipePrepTime":"Prep Time: 10 minutes mins",
     "recipeCookTime":"Cook Time: 30 minutes mins",
     "recipeTotalTIme":"Total Time: 40 minutes mins",
     "recipeAuthor":"Lalaine Manalo",
     "recipeIngredients":[
        "¼ cup canola oil",
        "2 medium potatoes, peeled and quartered",
        "1 onion, peeled and sliced thinly",
        "2 cloves garlic, peeled and minced",
        "1 thumb-size ginger, peeled and julienned",
        "1 (3 to 4 pounds) whole chicken, cut into parts",
        "1 tablespoon fish sauce",
        "1 can (13.5 ounces) coconut milk",
        "½ cup water",
        "4 Thai chili peppers, stemmed and chopped",
        "½ red bell pepper, seeded, cored and sliced into strips",
        "½ green bell pepper, seeded, cored and sliced into strips",
        "salt and pepper to taste"
     ],
     "recipeInstruction":[
        "In a wide skillet over medium heat, heat oil.  Add potatoes and cook, turning as needed, until lightly browned. With a slotted spoon, remove potatoes from the pan and drain on paper towels.",
        "Remove excess oil from pan except for about 2 tablespoons. Add onions, garlic, and ginger and cook until softened.",
        "Add chicken and cook until lightly browned.",
        "Add fish sauce and cook for about 1 minute.",
        "Add coconut milk, water, and chili peppers. Bring to a simmer, skimming any scum that floats on top.",
        "Lower heat, cover, and continue to cook for about 20 to 25 minutes or until chicken is cooked through and liquid is reduced.",
        "Add potatoes and cook for about 3 to 5 minutes or until potatoes are tender and sauce is thickened.",
        "Add bell peppers and cook for another 1 to 2 minutes or until tender yet crisp.",
        "Season with salt and pepper to taste. Serve hot."
    ],
     "recipeNutrition":[
        "Calories: 508kcal",
        "Carbohydrates: 16g",
        "Protein: 28g",
        "Fat: 38g",
        "Saturated Fat: 18g",
        "Cholesterol: 95mg",
        "Sodium: 345mg",
        "Potassium: 844mg",
        "Fiber: 3g",
        "Sugar: 3g",
        "Vitamin A: 811IU",
        "Vitamin C: 76mg",
        "Calcium: 57mg",
        "Iron: 6mg"
     ],
     "recipeVote":"4.29"
},
{
    "categoryName":"Rice & Noodles",
     "categoryName-href":"https://www.kawalingpinoy.com/category/recipe-index/rice-potatoes-and-noodles/",
     "link":"Kalamay Lansong",
     "link-ref":"https://www.kawalingpinoy.com/kalamay-lansong/",
     "recipeDescription":"Kalamay Lansong, made of glutinous rice flour, coconut milk, and latik topping, is delicious as a snack or dessert. This Filipino steamed rice cake is sticky, chewy, perfectly sweetened, and gluten-free!",
     "recipeImage-href":"https://www.kawalingpinoy.com/wp-content/uploads/2019/05/kalamay-lansong-11-680x680.jpg",
     "recipePrepTime":"Prep Time: 10 minutes mins",
     "recipeCookTime":"Cook Time: 40 minutes mins",
     "recipeTotalTIme":"Total Time: 50 minutes mins",
     "recipeAuthor":"Lalaine Manalo",
     "recipeIngredients":[
        "1 cup coconut cream",
        "4 cups glutinous rice flour",
        "1 ½ cups sugar",
        "2 ½ cups coconut milk"
        
     ],
     "recipeInstruction":[
        "In a pan over medium heat, add coconut cream and bring to a boil. Cook, stirring occasionally, until the liquid starts to thicken.",
        "Lower heat and continue to cook. As the oil starts to separate and solids begin to form, regularly stir and scrape the sides and bottom of the pan to prevent from burning.",
        "Continue to cook and stir until curds turn golden brown. Drain latik from the oil using a fine-mesh sieve.",
        "Wipe banana leaves with a damp cloth and line the inside of an 8-inch baking pan. Generously brush the banana leaf lining with coconut oil.",
        "In a large bowl, combine glutinous rice flour, coconut milk, and sugar. Stir together until the sugar is dissolved and the mixture is smooth and well blended.",
        "Strain the batter using a fine-mesh sieve to remove lumps.",
        "Pour the batter into the prepared baking pan and steam for about 20 to 25 minutes or until set and a toothpick inserted comes out clean.",
        "Remove from steamer and allow to cool completely. Invert the cake onto a serving platter and peel off the banana leaves.",
        "Liberally brush with coconut oil and top with latik. Cut into serving portions."
    ],
     "recipeNutrition":[
        "Calories: 676kcal",
        "Carbohydrates: 106g",
        "Protein: 7g",
        "Fat: 27g",
        "Saturated Fat: 23g",
        "Sodium: 11mg",
        "Potassium: 314mg",
        "Fiber: 3g",
        "Sugar: 38g",
        "Vitamin C: 1.6mg",
        "Calcium: 24mg",
        "Iron: 3.3mg"

     ],
     "recipeVote":"4.12"
},
{
    "categoryName":"Rice & Noodles",
     "categoryName-href":"https://www.kawalingpinoy.com/category/recipe-index/rice-potatoes-and-noodles/",
     "link":"Kalamay sa Latik",
     "link-ref":"https://www.kawalingpinoy.com/kalamay-sa-latik/",
     "recipeDescription":"Soft and chewy kalamay with sweet syrup, latik, and jackfruit is a tasty treat the whole family will love. Delicious as a snack or dessert!",
     "recipeImage-href":"https://www.kawalingpinoy.com/wp-content/uploads/2017/04/kalamay-sa-latik-12-680x680.jpg",
     "recipePrepTime":"Prep Time: 10 minutes mins",
     "recipeCookTime":"Cook Time: 1 hour hr",
     "recipeTotalTIme":"Total Time: 1 hour hr 10 minutes mins",
     "recipeAuthor":"Lalaine Manalo",
     "recipeIngredients":[
        "2 cups coconut cream",
        "3 cups glutinous rice flour",
        "1.5 cups coconut milk",
        "½ cup sugar",
        "1 cup water",
        "1 cup dark brown sugar",
        "1 cup sweetened jackfruit strips, drained"
     ],
     "recipeInstruction":[
        "In a pan over medium heat, add coconut cream and bring to a boil. Cook, stirring occasionally, until liquid starts to thicken.",
        "Lower heat and continue to cook. As the oil starts to separate and solids begin to form, regularly stir and scrape sides and bottom of the pan to prevent from burning.",
        "Continue to cook and stir until curds turn golden brown. Drain latik from the oil and store in a container until ready to use.",
        "In a bowl, combine glutinous flour, coconut milk, and sugar. Stir well until smooth and well-blended.",
        "Brush a baking pan with oil. Pour batter into the pan and steam for about 15 to 20 minutes or until mixture is set and a toothpick inserted comes out clean.",
        "Remove from heat and allow to completely cool. Transfer the rice cake to a cutting board and slice into about 1-inch pieces.",
        "In a saucepan over medium heat, combine water and dark brown sugar. Bring to a boil, stirring regularly until sugar is dissolved. Continue to cook until reduced and slightly thickened.",
        "Add kalamay pieces to the sweet syrup. Simmer for about 1 minute.",
        "To serve, place kalamay and syrup in serving bowls and sprinkle with latik and jackfruit strips. Serve warm."

        
    ],
     "recipeNutrition":[
        "Calories: 470kcal",
        "Carbohydrates: 66g",
        "Protein: 4g",
        "Fat: 22g",
        "Saturated Fat: 19g",
        "Sodium: 13mg",
        "Potassium: 267mg",
        "Fiber: 1g",
        "Sugar: 30g",
        "Vitamin C: 1.7mg",
        "Calcium: 30mg",
        "Iron: 2.5mg"
     ],
     "recipeVote":"4.84"
},
{
    "categoryName":"Rice & Noodles",
     "categoryName-href":"https://www.kawalingpinoy.com/category/recipe-index/rice-potatoes-and-noodles/",
     "link":"Palitaw",
     "link-ref":"https://www.kawalingpinoy.com/palitaw/",
     "recipeDescription":"Palitaw made with glutinous rice flour, grated coconut, sesame seeds, and sugar. Soft, chewy, and gluten-free, this Filipino delicacy is delicious as snack or dessert.",
     "recipeImage-href":"https://www.kawalingpinoy.com/wp-content/uploads/2018/12/palitaw-7-680x680.jpg",
     "recipePrepTime":"Prep Time: 10 minutes mins",
     "recipeCookTime":"Cook Time: 10 minutes mins",
     "recipeTotalTIme":"Total Time: 20 minutes mins",
     "recipeAuthor":"Lalaine Manalo",
     "recipeIngredients":[
        "¼ cup sesame seeds",
        "½ cup sugar",
        "2 cups glutinous rice flour",
        "1 cup water",
        "1 cup grated mature coconut",
        "water for boiling"
     ],
     "recipeInstruction":[
        "In a pan over medium heat, toast sesame seeds, stirring frequently, for about 30 to 40 seconds or until lightly browned and fragrant. Remove from heat and allow to cool.",
        "In a bowl, combine toasted sesame seeds and sugar. Set aside.",
        "In a bowl, combine rice flour and water and mix into a soft, pliable dough.",
        "Divide the dough into portions and using the palm of hands, shape into balls and then flatten into oval disks about ¼-inch thick.",
        "In a pot over medium heat, bring about 5-inch deep of water into a rolling boil.",
        "Individually drop the rice patties into the boiling water, making sure not to overcrowd the pot. Cook for about 2 to 3 minutes or until the patties float to the surface,",
        "Using a slotted spoon, remove from the water and drain well. Arrange in a single layer on a parchment-lined platter to keep from sticking together and let cool just enough to touch.",
        "While still warm, roll the palitaw on grated coconut to fully coat.",
        "Sprinkle with sesame-sugar mixture before serving."

    ],
     "recipeNutrition":[
        "Calories: 171kcal",
        "Carbohydrates: 31g",
        "Protein: 2g",
        "Fat: 4g",
        "Saturated Fat: 2g",
        "Sodium: 2mg",
        "Potassium: 58mg",
        "Fiber: 1g",
        "Sugar: 8g",
        "Vitamin C: 0.2mg",
        "Calcium: 34mg",
        "Iron: 0.7mg"

     ],
     "recipeVote":"4"
},
{
    "categoryName":"Rice & Noodles",
     "categoryName-href":"https://www.kawalingpinoy.com/category/recipe-index/rice-potatoes-and-noodles/",
     "link":"Biko",
     "link-ref":"https://www.kawalingpinoy.com/biko/",
     "recipeDescription":"Biko is the ultimate Filipino snack or dessert! Made of glutinous rice cooked in sweetened coconut milk, this rice cake is deliciously sweet, creamy, sticky, and gluten-free!",
     "recipeImage-href":"https://www.kawalingpinoy.com/wp-content/uploads/2018/09/biko-with-latik-1-680x680.jpg",
     "recipePrepTime":"Prep Time: 10 minutes mins",
     "recipeCookTime":"Cook Time: 1 hour hr 30 minutes mins",
     "recipeTotalTIme":"Total Time: 1 hour hr 40 minutes mins",
     "recipeAuthor":"Lalaine Manalo",
     "recipeIngredients":[
        "1 cup coconut cream (kakang gata)",
        "3 cups coconut milk",
        "2 cups glutinous rice",
        "1 ½ cups water",
        "1 cup dark brown sugar",
        "½ teaspoon salt"
     ],
     "recipeInstruction":[
        "In a pan over medium heat, add the coconut cream and bring to a boil. Continue to cook, stirring occasionally, until liquid starts to thicken.",
        "Lower heat and simmer. As oil starts to separate and solids begin to form, regularly stir and scrape sides and bottom of the pan to prevent from burning.",
        "Continue to cook and stir until curds turn golden brown. Using a fine-mesh sieve or colander, drain latik. Reserve oil.",
        "Grease bottom and sides of the baking dish with coconut oil. Set aside.",
        "Wash glutinous rice a few times or until water runs almost clear. Drain well.",
        "In a thick bottom pot, combine rice and water. Over medium heat, bring to a boil. Lower heat, cover, and cook until liquid is absorbed. Allow to cool to touch and fluff with a fork to separate grains.",
        "In a wide non-stick skillet over medium heat, combine coconut milk, brown sugar, and salt. Stir until blended and bring to a boil.",
        "Lower heat and continue to cook until slightly reduced and thickened.",
        "Add rice, gently stirring to evenly distribute. Cook, stirring occasionally, for about 1 hour or until mixture is very thick, sticky, and pulls away from the sides of the pan.",
        "Spoon biko into the prepared baking dish and pat down with a lightly greased spatula to even out.",
        "Lightly brush top with coconut oil, cut into portions, and top with latik."

    ],
     "recipeNutrition":[
        "Calories: 332kcal",
        "Carbohydrates: 45g",
        "Protein: 3g",
        "Fat: 16g",
        "Saturated Fat: 14g",
        "Sodium: 212mg",
        "Potassium: 213mg",
        "Sugar: 17g",
        "Vitamin C: 0.7mg",
        "Calcium: 33mg",
        "Iron: 3.1mg"
     ],
     "recipeVote":"4"
},
{
    "categoryName":"Rice & Noodles",
     "categoryName-href":"https://www.kawalingpinoy.com/category/recipe-index/rice-potatoes-and-noodles/",
     "link":"Ginataang Bilo Bilo",
     "link-ref":"https://www.kawalingpinoy.com/ginataang-bilo-bilo/",
     "recipeDescription":"Ginataang bilo-bilo is made with sweetened coconut milk, sticky rice balls, mini sago, and langka strips. It's creamy, delicious, and makes a filling snack or dessert.",
     "recipeImage-href":"https://www.kawalingpinoy.com/wp-content/uploads/2015/02/ginataang-bilo-bilo-6-680x680.jpg",
     "recipePrepTime":"Prep Time: 15 minutes mins",
     "recipeCookTime":"Cook Time: 40 minutes mins",
     "recipeTotalTIme":"Total Time: 55 minutes mins",
     "recipeAuthor":"Lalaine Manalo",
     "recipeIngredients":[
        "water",
        "½ cup uncooked mini sago pearls",
        "1 cup glutinous rice flour",
        "4 cups coconut milk",
        "1 cup sugar",
        "1 cup coconut cream",
        "1 cup ripe jackfruit shredded"

     ],
     "recipeInstruction":[
        "In a pot over medium heat, bring about 6 cups water to a boil. Add sago pearls and cook, stirring occasionally, for about 15 to 20 minutes or until soft and translucent. Rinse and drain well.",
        "In a small bowl, combine glutinous rice flour and ½ cup water into a pliable dough. If the dough is too sticky, add more flour and if too crumbly, add a little bit more water.",
        "Scoop about a teaspoon of dough and using the palms of hands, form about 1 into smooth balls. Cover prepared balls with cloth until ready to use.",
        "In a pot over medium heat, combine coconut milk and sugar. Bring to a simmer, stirring occasionally, until sugar is dissolved. Continue to cook until slightly reduced.",
        "Add glutinous rice balls and cook for about 8 to 10 minutes or until they begin to float to top.",
        "Add coconut cream and stir to combine. Continue to cook until slightly thickened.",
        "Add sago and jackfruit and continue to cook for about 3 to 5 minutes or until heated through.",
        "Ladle in bowls and top with additional coconut cream, if desired."
    ],
     "recipeNutrition":[
        "Calories: 543kcal",
        "Carbohydrates: 59g",
        "Protein: 5g",
        "Fat: 35g",
        "Saturated Fat: 31g",
        "Polyunsaturated Fat: 0.5g",
        "Monounsaturated Fat: 2g",
        "Sodium: 31mg",
        "Potassium: 383mg",
        "Fiber: 2g",
        "Sugar: 25g",
        "Vitamin A: 0.4IU",
        "Vitamin C: 2mg",
        "Calcium: 36mg",
        "Iron: 5mg"
     ],
     "recipeVote":"4.84"
},
{
    "categoryName":"Rice & Noodles",
     "categoryName-href":"https://www.kawalingpinoy.com/category/recipe-index/rice-potatoes-and-noodles/",
     "link":"Pancit Palabok",
     "link-ref":"https://www.kawalingpinoy.com/pancit-palabok/",
     "recipeDescription":"Pancit Palabok with rice noodles, flavorful shrimp gravy, and assorted toppings makes a delicious midday snack or main meal and is sure to be a family favorite. Perfect for gatherings and special occasions!",
     "recipeImage-href":"https://www.kawalingpinoy.com/wp-content/uploads/2017/03/filipino-pancit-palabok-2-680x680.jpg",
     "recipePrepTime":"Prep Time: 30 minutes mins",
     "recipeCookTime":"Cook Time: 30 minutes mins",
     "recipeTotalTIme":"Total Time: 1 hour hr",
     "recipeAuthor":"Lalaine Manalo",
     "recipeIngredients":[
        "½ pound shrimp",
        "canola oil",
        "½ pound pork belly, diced",
        "8 ounces firm tofu",
        "½ cup tinapa flakes",
        "1 head garlic, peeled and minced",
        "1 cup pork cracklings (chicharon), crushed",
        "4 hardboiled eggs, peeled and quartered",
        "¼ cup green onions, chopped",
        "calamansi or lemon, cut into wedges",
        "shrimp heads ( reserved from peeling the shrimp)",
        "5 cups water",
        "¼ cup canola oil",
        "2 tablespoons annatto seeds",
        "⅓ cup flour",
        "2 pieces shrimp bouillon",
        "salt and pepper to taste",
        "1 package (8 ounces) cornstarch or rice stick noodles"
     ],
     "recipeInstruction":[
        "Peel shrimp, leaving tail intact. Reserve shrimp heads. In a saucepan over medium heat, bring 1 cup water to a boil. Place shrimp in a fine-mesh sieve and dip in the boiling water until the shrimp change color. Remove from the pot and set aside. Reserve liquid.",
        "In a skillet over medium heat, add pork belly and cook, stirring occasionally, it releases oil. Continue to cook until browned and cooked through. Remove from pan and drain on paper towels.",
        "Drain tofu from packing liquid and wrap with paper towels to rid of extra moisture. Cut into ¼-inch cubes. In a wide pan, heat about 1-inch deep of oil. Add tofu and deep-fry until golden brown and crisp. Using a slotted spoon, remove from, and set aside.",
        "In a pan over medium heat, add 1 tablespoon oil. Add tinapa flakes and cook, stirring regularly, for about 1 to 2 minutes or until lightly browned and heated through. Remove from pan and set aside.",
        "In a small pan over low heat, heat about ¼ cup oil. Add garlic and cook until lightly browned and crisp. With a slotted spoon, remove toasted garlic and drain on paper towels. Reserve 3 tablespoons of the garlic oil.",
        "With a knife, coarsely chop reserved shrimp heads.",
        "In a pot over medium heat, combine shrimp heads and 5 cups water. Bring to a boil, skimming any foam that rises on top. Lower heat and simmer for about 10 minutes to extract flavor. Using a fine-mesh strainer, strain liquid and discard shrimp solids. Reserve 5 cups of the stock.",
        "In a saucepot over medium heat, heat ¼ cup canola oil. Add 2 tablespoons of annatto seeds and cook, stirring regularly, until oil is infused with deep-orange color. With a slotted spoon, remove seeds and discard.",
        "Add flour to the annatto oil and cook, stirring constantly, for about 1 minute or until smooth.",
        "Slowly add shrimp stock, whisking vigorously to prevent lumps. Bring to a boil and then lower heat to a simmer.",
        "Add shrimp bouillon and stir until dissolved.",
        "Cook, stirring regularly, for about 3 to 5 minutes or until thickened. Season with salt and pepper to taste.",
        "In a large bowl, soak rice noodles in water for about 1 to 2 minutes or just until loosened. Drain well.",
        "In a pot over medium heat, bring about 6 cups water to a brisk boil. Add noodles and cook for about 1 minute. Drain well.",
        "Place noodles onto serving plates. Spoon sauce over noodles.",
        "Top with shrimp, chicharon, fried pork, crispy tofu, tinapa flakes, hardboiled eggs, toasted garlic bits, and green onions. Serve with calamansi wedges."
    ],
     "recipeNutrition":[
        "Calories: 440kcal",
        "Carbohydrates: 8g",
        "Protein: 19g",
        "Fat: 36g",
        "Saturated Fat: 10g",
        "Polyunsaturated Fat: 6g",
        "Monounsaturated Fat: 17g",
        "Trans Fat: 0.04g",
        "Cholesterol: 166mg",
        "Sodium: 242mg",
        "Potassium: 210mg",
        "Fiber: 1g",
        "Sugar: 1g",
        "Vitamin A: 221IU",
        "Vitamin C: 2mg",
        "Calcium: 88mg",
        "Iron: 2mg"

     ],
     "recipeVote":"4.21"
},
{
    "categoryName":"Rice & Noodles",
     "categoryName-href":"https://www.kawalingpinoy.com/category/recipe-index/rice-potatoes-and-noodles/",
     "link":"Mock Pancit Canton Stir-Fry",
     "link-ref":"https://www.kawalingpinoy.com/mock-pancit-canton-stir-fry/",
     "recipeDescription":"Mock Pancit Canton Stir-fry is a delicious way to turn instant ramen noodles into a hearty and tasty meal. Chock full of shrimp, chicken, and veggies, it's an easy weeknight dinner the whole family will love!",
     "recipeImage-href":"https://www.kawalingpinoy.com/wp-content/uploads/2014/11/mock-pancit-canton-stir-fry-instant-ramen-1-680x680.jpg",
     "recipePrepTime":"Prep Time: 10 minutes mins",
     "recipeCookTime":"Cook Time: 20 minutes mins",
     "recipeTotalTIme":"Total Time: 30 minutes mins",
     "recipeAuthor":"Lalaine Manalo",
     "recipeIngredients":[
        "2 packs Lucky Me Instant Pancit Canton or Indomie instant ramen noodles",
        "1 tablespoon canola oil",
        "1 onion, peeled and chopped",
        "¼ pound boneless chicken breast, sliced thinly",
        "2 pieces Chinese sausage, sliced thin in a bias",
        "¼ pound shrimp, peeled and deveined",
        "1 large carrot, peeled and julienned",
        "1 head broccoli, cut into florets",
        "fried garlic bits",
        "green onions, chopped",
        "calamansi, halved"
     ],
     "recipeInstruction":[
        "In a sauce pot over medium heat, cook instant noodles according to package directions. Drain well, reserving about ¼ cup of the liquid.",
        "Add seasoning packet to the drained noodles and toss to fully coat.",
        "In a wide pan over medium heat, heat canola oil. Add onions and cook until softened.",
        "Add chicken and cook, stirring regularly until lightly browned.",
        "Add Chinese sausage and cook, stirring regularly, until lightly browned.",
        "Add shrimp and cook until color changes to pink.",
        "Add broccoli.",
        "Add reserved liquid and continue to cook, stirring regularly, until broccoli florets are tender yet crisp and liquid is absorbed.",
        "Add carrots and cook until tender-crisp.",
        "Add instant noodles and continue to cook, tossing to combine, until heated through.",
        "To serve, transfer to serving plate and garnish with fried garlic bits, green onions, and calamansi, if desired. Serve hot."

    ],
     "recipeNutrition":[
        "Calories: 348kcal",
        "Carbohydrates: 41g",
        "Protein: 21g",
        "Fat: 12g",
        "Saturated Fat: 4g",
        "Cholesterol: 90mg",
        "Sodium: 1185mg",
        "Potassium: 773mg",
        "Fiber: 6g",
        "Sugar: 5g",
        "Vitamin A: 3495IU",
        "Vitamin C: 140mg",
        "Calcium: 136mg",
        "Iron: 3.6mg"


     ],
     "recipeVote":"2"
},
{
    "categoryName":"Rice & Noodles",
     "categoryName-href":"https://www.kawalingpinoy.com/category/recipe-index/rice-potatoes-and-noodles/",
     "link":"Ginataang Mais",
     "link-ref":"https://www.kawalingpinoy.com/ginataang-mais/",
     "recipeDescription":"Coconut Rice Pudding with sweet corn kernels is a hearty and tasty snack or dessert. This Ginataang mais is quick and easy to make, and naturally gluten-free!",
     "recipeImage-href":"https://www.kawalingpinoy.com/wp-content/uploads/2019/04/creamy-ginataang-mais-680x680.jpg",
     "recipePrepTime":"Prep Time: 10 minutes mins",
     "recipeCookTime":"Cook Time: 40 minutes mins",
     "recipeTotalTIme":"Total Time: 50 minutes mins",
     "recipeAuthor":"Lalaine Manalo",
     "recipeIngredients":[
        "3 fresh corn cobs or 1 ½ cups canned corn kernels",
        "2 cans (13.5 ounces) coconut milk",
        "3 cups water",
        "1 cup glutinous rice, rinsed and drained well",
        "1 ½ cups coconut cream",
        "1 cup sugar"
     ],
     "recipeInstruction":[
        "Shuck the corn cobs by removing the husks and silks. Using a sharp knife, cut the stem ends.",
        "In a large bowl, stand an ear of corn up and using a small knife, thinly cut the kernels off from top to bottom. Rotate the corn when done with each section to get to the next.",
        "Using a spoon, scrape the sides of the cobs using a spoon to extract the remaining pulp and milky juice.",
        "In a pot over medium heat, combine coconut milk and water and bring to a simmer.",
        "Add rice and fresh corn kernels and stir to combine. If using canned corn, add later along with the coconut cream and sugar.",
        "Lower heat and continue to cook, stirring occasionally, for about 15 to 20 minutes or until rice begins to expand and soften.",
        "Add 1 cup of the coconut cream and sugar, stirring until sugar is dissolved. Continue to cook, stirring occasionally for about 8 to 10 minutes or rice is cooked through and the mixture is thickened.",
        "Ladle into serving bowls and drizzle with the remaining ½ cup of coconut cream as desired. Serve warm or cold."     
    ],
     "recipeNutrition":[
        "Calories: 519kcal",
        "Carbohydrates: 49g",
        "Protein: 5g",
        "Fat: 36g",
        "Saturated Fat: 31g",
        "Sodium: 20mg",
        "Potassium: 374mg",
        "Fiber: 1g",
        "Sugar: 24g",
        "Vitamin C: 2.2mg",
        "Calcium: 28mg",
        "Iron: 4.6mg"

     ],
     "recipeVote":"3.72"
}

]